cpd.org
#+title: CPD
#+startup: overview
#+setupfile: export/cpd.setup

* [2023-03-06 Mon] Ethical item

Project 9011 Green Square Stage 4 Excavation - IV

- SEA Independant verification
- Structural report by VDM did not provide the typical necessary results to assess against SW guidelines and calcs hid the fact that the culvert did not pass
- Pressure from client to get the report out same day
- It was discovered that the loading exceeded both the SW guidelines and in some cases the ULS strength under the post-development loading provided by geotech assessment
- Client notified about the issue. We positioned ourselves as not delaying the package submission but as saving the client time of submitting and having the development rejected by SW
- Resolution: geotechnical report was revised based on geotech IV recommendations that the original analysis was overly conservative. Under the revised loading the culvert passed the SW loading guidelines for SEA
* [2023-02-16 Thu] Penetron presentation
:PROPERTIES:
:type: External presentation
:END:
:LOGBOOK:
CLOCK: [2023-02-16 Thu 12:00]--[2023-02-16 Thu 13:00] =>  1:00
:END:

- *Presenter*: Hacene Baleh, hacene@penetron.com.au - Penetron

- Concrete deteriation: corrosion of rebar, freeze/thaw
- Penetron admixture used to seal up pores
- Hydrophylic material can be used for non-hydrostatic
- Hydrostatic - using SB admixture

- Secant pile vertical cold joints treated with Penecreate mortar
- Penebar installed horizontally within slab
- Penebar min cover 55mm

- Admixture is only suitable for static cracking, isn't going to work for dynamic loading
- BS8102/2009 gives watertightness specifications

- Carbon dioxide + carbon hydroxide = calcium carbonate + water
- Calcium carbonate lowers pH below 9 so corrosion can occur
- Cut the water element prevents corrosion

- Chloride attack near to sea
- Cut the water element prevents corrosion

- With preliminary drawings, penetron is able to markup details for waterproofing
- Pick and drop notes available
- Library of standard details and notes
* [2023-02-10 Fri] The Structural Engineering Podcast
:PROPERTIES:
:type: podcast
:END:
:LOGBOOK:
CLOCK: [2023-02-10 Sat 17:30]--[2023-02-10 Sat 18:30] =>  1:00
:END:

- *Title*: Building with the future in mind
- *Presenter*: Ethan Fogle (HGA Architects and Engineers)

- From an embodied carbon perspective Timber > Steel > Concrete
- Engineers to be involved in the ideation phase to bring sustainability values to projects
- Idea of quantising embodied carbon as part of material takeoff

* [2023-02-08 Wed] Timber design series

Webinars from NZ timber design society:
https://www.timberdesign.org.nz/timber-design-society-2022-series/

* [2023-02-04 Sat] Episode 71 - Structural engineering podcast
:PROPERTIES:
:type: podcast
:END:
:LOGBOOK:
CLOCK: [2023-02-03 Sat 17:30]--[2023-02-03 Sat 18:30] =>  0:00
:END:

- *Title*: Dampers, How to shake it up and slow it down
- *Presenter*: Trevor Haskett, Motioneering
- *Link*: https://castbox.fm/channel/id1486472?country=us

- Tuned mass dampers (steel typ) or sloshing tank dampers are being commonly used for buildings larger than 30 storeys
- Currently for serviceability only, not to reduce ULS
- Reverse calcs used to check pools on upper levels
- Usually effective at 1-1.5% of the modal mass
- Take up prime real estate but can be used to increase 5-10 storeys

* [2023-02-03 Fri] How to become a Chartered Engineer info session
:PROPERTIES:
:type: EA presentation
:END:
:LOGBOOK:
CLOCK: [2023-02-03 Fri 12:30]--[2023-02-03 Fri 13:30] =>  1:00
:END:

- *Presenter*: Paul Sloam, Jessica Milestone
- Area of practice: Structural Engineering
- Assessment:
  1. Self assessment, rating of Functional or above required in all 16
     competencies
  2. Industry review, for each piece of evidence provided to address
     16 competencies it is reviewed
  3. Enrol for chartered, CV and CPD hours - can record CPD in another
     method than online tracker, just requires standardised info (look
     up )
  4. Evidence process
  5. Professional interview

* [2023-02-03 Fri] TSEC 95 Why Mass Timber is Gaining popularity
:PROPERTIES:
:type: podcast
:END:
:LOGBOOK:
CLOCK: [2023-02-03 Fri 07:20]--[2023-02-03 Fri 07:50] =>  0:30
:END:

- *Title*: Why Mass Timber is Gaining popularity
- *Presenter*: Eric McDonnell

- Provides a difference in feels which is appealing to end users
- Supply is a key to working out feasibility
- advice to take hold of career opportunities

* [2022-11-26 Sat] PTD column fixity

- RCB should be pin-pin columns so that all lateral load is transfered to the core
- PTD should be pin-pin, but long columns to be converted into walls to give more accurate deflection results
* [2022-12-13 Tue] Facade engineering
:PROPERTIES:
:type: Indesco training
:END:
:LOGBOOK:
CLOCK: [2022-12-13 Tue 12:00]--[2022-12-13 Tue 13:00] =>  1:00
:END:
- *Presenter*: Aaron Hazelton, Michael Smith, Liam Pickett

- FP1.4 report dealing with waterproofing
- Core idea is rain screen, preventing rain from entering the building

- Wind analysis - Indesco to use Checkwind
- Liability is to complete a wind pressure report and giving
  termination heights for membrane/flashing, we are not sizing up
  members as these are usually tested and certified to a specific
  level
  
- *Report*
  - Introducion
    - Intent of document
    - Project description
    - Development specifications / facade systems
    - Environmental conditions
  - Stakeholders
  - NCC Performance Requirements
    - Compliance with perf reqs - always performance solution
  - Assessment method
    - Arch details and shop drawings
    - Glazing
    - Waterproofing membranes
    - Membrane upward vertical termination heights - based on
      windspeed and AS4654.2
    - Cladding (paying attention to joints between claddings)
    - Air seal and vapour barriers
    - Material compatibility
    - Site inspection
  - Site testing
    - Water penetration tests (glazing)
    - Gutter testing
    - Membrane testing
    - Box gutter testing
    - Witness (the test to be witnessed)
    - Results of testing
  - Review of glazing
    
- L:\Structural Design\Books, Catalogues & Drawings\Facade
