cpd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-07 Tue 14:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CPD</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="export/cpd.css" />

<link rel="icon" type="image/ico" href="html-export/cpd-favicon.svg" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">


</head>
<body>
<div id="content" class="content">
<h1 class="title">CPD</h1>

<div id="outline-container-org6729a10" class="outline-2">
<h2 id="org6729a10"><span class="timestamp-wrapper"><span class="timestamp">[2023-03-06 Mon] </span></span> Ethical item</h2>
<div class="outline-text-2" id="text-org6729a10">
<p>
Project 9011 Green Square Stage 4 Excavation - IV
</p>

<ul class="org-ul">
<li>SEA Independant verification</li>
<li>Structural report by VDM did not provide the typical necessary results to assess against SW guidelines and calcs hid the fact that the culvert did not pass</li>
<li>Pressure from client to get the report out same day</li>
<li>It was discovered that the loading exceeded both the SW guidelines and in some cases the ULS strength under the post-development loading provided by geotech assessment</li>
<li>Client notified about the issue. We positioned ourselves as not delaying the package submission but as saving the client time of submitting and having the development rejected by SW</li>
<li>Resolution: geotechnical report was revised based on geotech IV recommendations that the original analysis was overly conservative. Under the revised loading the culvert passed the SW loading guidelines for SEA</li>
</ul>
</div>
</div>
<div id="outline-container-org3019589" class="outline-2">
<h2 id="org3019589"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-16 Thu] </span></span> Penetron presentation</h2>
<div class="outline-text-2" id="text-org3019589">
<ul class="org-ul">
<li><b>Presenter</b>: Hacene Baleh, hacene@penetron.com.au - Penetron</li>

<li>Concrete deteriation: corrosion of rebar, freeze/thaw</li>
<li>Penetron admixture used to seal up pores</li>
<li>Hydrophylic material can be used for non-hydrostatic</li>
<li>Hydrostatic - using SB admixture</li>

<li>Secant pile vertical cold joints treated with Penecreate mortar</li>
<li>Penebar installed horizontally within slab</li>
<li>Penebar min cover 55mm</li>

<li>Admixture is only suitable for static cracking, isn't going to work for dynamic loading</li>
<li>BS8102/2009 gives watertightness specifications</li>

<li>Carbon dioxide + carbon hydroxide = calcium carbonate + water</li>
<li>Calcium carbonate lowers pH below 9 so corrosion can occur</li>
<li>Cut the water element prevents corrosion</li>

<li>Chloride attack near to sea</li>
<li>Cut the water element prevents corrosion</li>

<li>With preliminary drawings, penetron is able to markup details for waterproofing</li>
<li>Pick and drop notes available</li>
<li>Library of standard details and notes</li>
</ul>
</div>
</div>
<div id="outline-container-org86da131" class="outline-2">
<h2 id="org86da131"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-10 Fri] </span></span> The Structural Engineering Podcast</h2>
<div class="outline-text-2" id="text-org86da131">
<ul class="org-ul">
<li><b>Title</b>: Building with the future in mind</li>
<li><b>Presenter</b>: Ethan Fogle (HGA Architects and Engineers)</li>

<li>From an embodied carbon perspective Timber &gt; Steel &gt; Concrete</li>
<li>Engineers to be involved in the ideation phase to bring sustainability values to projects</li>
<li>Idea of quantising embodied carbon as part of material takeoff</li>
</ul>
</div>
</div>

<div id="outline-container-orgc3858c4" class="outline-2">
<h2 id="orgc3858c4"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-08 Wed] </span></span> Timber design series</h2>
<div class="outline-text-2" id="text-orgc3858c4">
<p>
Webinars from NZ timber design society:
<a href="https://www.timberdesign.org.nz/timber-design-society-2022-series/">https://www.timberdesign.org.nz/timber-design-society-2022-series/</a>
</p>
</div>
</div>

<div id="outline-container-org099c423" class="outline-2">
<h2 id="org099c423"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-04 Sat] </span></span> Episode 71 - Structural engineering podcast</h2>
<div class="outline-text-2" id="text-org099c423">
<ul class="org-ul">
<li><b>Title</b>: Dampers, How to shake it up and slow it down</li>
<li><b>Presenter</b>: Trevor Haskett, Motioneering</li>
<li><b>Link</b>: <a href="https://castbox.fm/channel/id1486472?country=us">https://castbox.fm/channel/id1486472?country=us</a></li>

<li>Tuned mass dampers (steel typ) or sloshing tank dampers are being commonly used for buildings larger than 30 storeys</li>
<li>Currently for serviceability only, not to reduce ULS</li>
<li>Reverse calcs used to check pools on upper levels</li>
<li>Usually effective at 1-1.5% of the modal mass</li>
<li>Take up prime real estate but can be used to increase 5-10 storeys</li>
</ul>
</div>
</div>

<div id="outline-container-orgab13533" class="outline-2">
<h2 id="orgab13533"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-03 Fri] </span></span> How to become a Chartered Engineer info session</h2>
<div class="outline-text-2" id="text-orgab13533">
<ul class="org-ul">
<li><b>Presenter</b>: Paul Sloam, Jessica Milestone</li>
<li>Area of practice: Structural Engineering</li>
<li>Assessment:
<ol class="org-ol">
<li>Self assessment, rating of Functional or above required in all 16
competencies</li>
<li>Industry review, for each piece of evidence provided to address
16 competencies it is reviewed</li>
<li>Enrol for chartered, CV and CPD hours - can record CPD in another
method than online tracker, just requires standardised info (look
up )</li>
<li>Evidence process</li>
<li>Professional interview</li>
</ol></li>
</ul>
</div>
</div>

<div id="outline-container-orgb28659b" class="outline-2">
<h2 id="orgb28659b"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-03 Fri] </span></span> TSEC 95 Why Mass Timber is Gaining popularity</h2>
<div class="outline-text-2" id="text-orgb28659b">
<ul class="org-ul">
<li><b>Title</b>: Why Mass Timber is Gaining popularity</li>
<li><b>Presenter</b>: Eric McDonnell</li>

<li>Provides a difference in feels which is appealing to end users</li>
<li>Supply is a key to working out feasibility</li>
<li>advice to take hold of career opportunities</li>
</ul>
</div>
</div>

<div id="outline-container-org44fe7aa" class="outline-2">
<h2 id="org44fe7aa"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-26 Sat] </span></span> PTD column fixity</h2>
<div class="outline-text-2" id="text-org44fe7aa">
<ul class="org-ul">
<li>RCB should be pin-pin columns so that all lateral load is transfered to the core</li>
<li>PTD should be pin-pin, but long columns to be converted into walls to give more accurate deflection results</li>
</ul>
</div>
</div>
<div id="outline-container-org27175aa" class="outline-2">
<h2 id="org27175aa"><span class="timestamp-wrapper"><span class="timestamp">[2022-12-13 Tue] </span></span> Facade engineering</h2>
<div class="outline-text-2" id="text-org27175aa">
<ul class="org-ul">
<li><b>Presenter</b>: Aaron Hazelton, Michael Smith, Liam Pickett</li>

<li>FP1.4 report dealing with waterproofing</li>
<li>Core idea is rain screen, preventing rain from entering the building</li>

<li>Wind analysis - Indesco to use Checkwind</li>
<li>Liability is to complete a wind pressure report and giving
termination heights for membrane/flashing, we are not sizing up
members as these are usually tested and certified to a specific
level</li>

<li><b>Report</b>
<ul class="org-ul">
<li>Introducion
<ul class="org-ul">
<li>Intent of document</li>
<li>Project description</li>
<li>Development specifications / facade systems</li>
<li>Environmental conditions</li>
</ul></li>
<li>Stakeholders</li>
<li>NCC Performance Requirements
<ul class="org-ul">
<li>Compliance with perf reqs - always performance solution</li>
</ul></li>
<li>Assessment method
<ul class="org-ul">
<li>Arch details and shop drawings</li>
<li>Glazing</li>
<li>Waterproofing membranes</li>
<li>Membrane upward vertical termination heights - based on
windspeed and AS4654.2</li>
<li>Cladding (paying attention to joints between claddings)</li>
<li>Air seal and vapour barriers</li>
<li>Material compatibility</li>
<li>Site inspection</li>
</ul></li>
<li>Site testing
<ul class="org-ul">
<li>Water penetration tests (glazing)</li>
<li>Gutter testing</li>
<li>Membrane testing</li>
<li>Box gutter testing</li>
<li>Witness (the test to be witnessed)</li>
<li>Results of testing</li>
</ul></li>
<li>Review of glazing</li>
</ul></li>

<li>L:\Structural Design\Books, Catalogues &amp; Drawings\Facade</li>
</ul>
</div>
</div>
