cpd.org
* [2022-11-03 Thu] The art of mass timber
:PROPERTIES:
:type: Podcast
:END:
:LOGBOOK:
CLOCK: [2022-11-03 Thu 12:30]--[2022-11-03 Thu 13:00] =>  0:30
:END:
- Title: The Structural Engineering Podcast 69: The art of mass timber
- Interviewee: Robert Malczyk
- Fast construction - saving on labour, plant hire, crane, etc 
* [2022-10-21 Fri] Risk and Redundancy
:PROPERTIES:
:type: Indesco training
:END:
:LOGBOOK:
CLOCK: [2022-10-21 Fri 12:30]--[2022-10-21 Fri 13:00] =>  0:30
:END:

- All designs reviewed by Chartered engineer
- Any complex/critical parts should be identified to the reviewer
- Complicated (hanging walls/transfers/etc) put risk into the job
- Value from us can come from eliminating complexity if we can
* [2022-10-14 Fri] RAM concept
:PROPERTIES:
:type: Indesco training
:END:
:LOGBOOK:
CLOCK: [2022-10-14 Fri 12:30]--[2022-10-14 Fri 13:30] =>  1:00
:END:
- Presenter :: Dave Southgate (Indesco)

- Work through criteria tab + materials (should be cornet)
- Bring in dwg (work way down lhs)
- Walls can't overlap
- Add area loads + perimeter loads
- Requires nomination of design strips - use auto gen and adjust (as per AS3600)
- Strands can be bulk editted
- Stress end to be nominated
- Analysis - run along the top tool bar
- Punching shear - have to identify columns to do check on
- Very sensitive to creep faction (deflections) (ram typically more conservative / larger deflection)

* [2022-10-13 Thu] MIDAS Civil

- Used for design of bridges
- Youtube tutorial: [[https://www.youtube.com/watch?v=ONzSQBbIQ78][Super T Bridge Design as per AS 5100]]
- Model setup guide (not great): https://www.civilax.com/midas-training-super-t-girder-bridge-as-per-as-5100-with-midas-civil/

* [2022-10-07 Fri] Joints in concrete floors and pavements
:PROPERTIES:
:type: EA presentation
:END:
:LOGBOOK:
CLOCK: [2022-10-07 Fri 12:25]--[2022-10-07 Fri 13:30] =>  1:05
:END:

- Presenter: Arslan Awan (Leviat)

  - Industrial floors SOG design suggested guideline is TR34 4th edn
  - 1.5mm joint opening results in 5% strength reduction (agg. interlock and key joints)
  - Design can be done by assuming 50% shear goes to dowel and 50% to ground
  - Sawcuts within 4hours (summer) to 18hours(winter)
  - Square dowel provides lateral movement +/-3mm up to 10mm (look to TR34.4 for design)
  - Dowel alignment is important
  - No sharp corners as they will break off
  - Punching is normal mode of failure so for normal thickness smaller dowels often better
* [2022-09-26 Mon] How Online Presence Can Help Your Engineering Career
:PROPERTIES:
:type: Podcast
:END:
:LOGBOOK:
CLOCK: [2022-09-26 Mon 17:00]--[2022-09-26 Mon 18:00] =>  1:00
:END:
- Title: TSEC 86: How Online Presence Can Help Your Engineering Career
- Interviewee: Luis Duque, Bridge Engineer (Foothills Bridge)
- Use of LinkdIn/Insta/Personal blog to share what you are learning
- Advocates blogging or podcasting to build internet presence
- Advocates for networking, building connections with others in industry
- Additional work outside work hours: tip is to work when energy levels are there, not forcing it, and consistency
* [2022-09-06 Tue] Automation and Communication in Structural Engineering
:PROPERTIES:
:type: Podcast
:END:
:LOGBOOK:
CLOCK: [2022-09-06 Mon 12:00]--[2022-09-06 Mon 13:00] =>  1:00
:END:
- Title: TSEC 85: Automation and Communication in Structural Engineering: Shaping the Future of Industry
- Interviewee: Michael Bolduc (Simpson Gumpertz & Heger [SGH])
- Use of BIM/Revit to coordinate between disciplines
- Importance of communication with architect due to faster pace of projects
- Future direction is having BIM model as project deliverable
- Do not detail too early in design to avoid time consuming changes

* [2022-08-08 Mon] Innovative Ways to Design and Build with Concrete
:PROPERTIES:
:type: Podcast
:END:
:LOGBOOK:
CLOCK: [2022-08-08 Mon 12:57]--[2022-08-08 Mon 13:57] =>  1:00
:END:
- Title: TSEC 83: Innovative Ways to Design and Build with Concrete
- Helix reinforcement, generally used for slab on ground
- Urged people to get involved with standards committees
- Looking at efficient performance based design (yield line analysis, etc) 

* [2022-05-16 Mon] CORD software training
:PROPERTIES:
:type: Self learning
:END:
SCHEDULED: <2022-05-16 Mon 9:00-11:00>
- Learnt software CORD for design of residential slabs to AS2870

* [2021-10-01 Fri] Seismic design of post installed anchors
:PROPERTIES:
:type: EA presentation
:END:
:LOGBOOK:
CLOCK: [2021-10-01 Fri 13:30]--[2021-10-01 Fri 14:30] =>  1:00
:END:

- Presenter: Damish Zuberi (Hilti)

  - Based on latest update to AS 5216
  - Bolts carry a seismic category rating (C1 or C2)
* [2021-09-30 Thu] Ultra-floor design
:PROPERTIES:
:type: Indesco training
:END:
:LOGBOOK:
CLOCK: [2021-09-30 Fri 12:30]--[2021-09-30 Fri 13:30] =>  1:00
:END:
- Presenter: Aaron Hazelton (Indesco)

  - Precast prestressed beams with concrete topping
  - Design always to capacity
  - Focus needs to be on detailing
    
* [2021-09-23 Thu] Site inspection report

** Details
- Location
- Job number
- Date
- Inspection stage
- Builder contractor
- Issued to/Inspected by/Signature

** Comments
Indesco inspected the preparations for XXX. At the time of inspection
reinforcement had been installed up to XXX. All work appeared to
satisfy the desgn intent with the following comments:

** Instructions
Prior to pour, contractor to ensure:
- Appropriate cover is maintained
- Site is cleared of debris
- Concrete is properly vibrated/compacted

