cpd.html
<div id="outline-container-org2a2ba83" class="outline-2">
<h2 id="org2a2ba83"><span class="timestamp-wrapper"><span class="timestamp">[2022-11-03 Thu] </span></span> The art of mass timber</h2>
<div class="outline-text-2" id="text-org2a2ba83">
<ul class="org-ul">
<li>Title: The Structural Engineering Podcast 69: The art of mass timber</li>
<li>Interviewee: Robert Malczyk</li>
<li>Fast construction - saving on labour, plant hire, crane, etc</li>
</ul>
</div>
</div>
<div id="outline-container-orgbddba83" class="outline-2">
<h2 id="orgbddba83"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-21 Fri] </span></span> Risk and Redundancy</h2>
<div class="outline-text-2" id="text-orgbddba83">
<ul class="org-ul">
<li>All designs reviewed by Chartered engineer</li>
<li>Any complex/critical parts should be identified to the reviewer</li>
<li>Complicated (hanging walls/transfers/etc) put risk into the job</li>
<li>Value from us can come from eliminating complexity if we can</li>
</ul>
</div>
</div>
<div id="outline-container-org2509f67" class="outline-2">
<h2 id="org2509f67"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-14 Fri] </span></span> RAM concept</h2>
<div class="outline-text-2" id="text-org2509f67">
<dl class="org-dl">
<dt>Presenter</dt><dd>Dave Southgate (Indesco)</dd>

<dt>(no term)</dt><dd>Work through criteria tab + materials (should be cornet)</dd>
<dt>(no term)</dt><dd>Bring in dwg (work way down lhs)</dd>
<dt>(no term)</dt><dd>Walls can't overlap</dd>
<dt>(no term)</dt><dd>Add area loads + perimeter loads</dd>
<dt>(no term)</dt><dd>Requires nomination of design strips - use auto gen and adjust (as per AS3600)</dd>
<dt>(no term)</dt><dd>Strands can be bulk editted</dd>
<dt>(no term)</dt><dd>Stress end to be nominated</dd>
<dt>(no term)</dt><dd>Analysis - run along the top tool bar</dd>
<dt>(no term)</dt><dd>Punching shear - have to identify columns to do check on</dd>
<dt>(no term)</dt><dd>Very sensitive to creep faction (deflections) (ram typically more conservative / larger deflection)</dd>
</dl>
</div>
</div>

<div id="outline-container-orgc5ecbbf" class="outline-2">
<h2 id="orgc5ecbbf"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-13 Thu] </span></span> MIDAS Civil</h2>
<div class="outline-text-2" id="text-orgc5ecbbf">
<ul class="org-ul">
<li>Used for design of bridges</li>
<li>Youtube tutorial: <a href="https://www.youtube.com/watch?v=ONzSQBbIQ78">Super T Bridge Design as per AS 5100</a></li>
<li>Model setup guide (not great): <a href="https://www.civilax.com/midas-training-super-t-girder-bridge-as-per-as-5100-with-midas-civil/">https://www.civilax.com/midas-training-super-t-girder-bridge-as-per-as-5100-with-midas-civil/</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbe48ffa" class="outline-2">
<h2 id="orgbe48ffa"><span class="timestamp-wrapper"><span class="timestamp">[2022-10-07 Fri] </span></span> Joints in concrete floors and pavements</h2>
<div class="outline-text-2" id="text-orgbe48ffa">
<ul class="org-ul">
<li>Presenter: Arslan Awan (Leviat)

<ul class="org-ul">
<li>Industrial floors SOG design suggested guideline is TR34 4th edn</li>
<li>1.5mm joint opening results in 5% strength reduction (agg. interlock and key joints)</li>
<li>Design can be done by assuming 50% shear goes to dowel and 50% to ground</li>
<li>Sawcuts within 4hours (summer) to 18hours(winter)</li>
<li>Square dowel provides lateral movement +/-3mm up to 10mm (look to TR34.4 for design)</li>
<li>Dowel alignment is important</li>
<li>No sharp corners as they will break off</li>
<li>Punching is normal mode of failure so for normal thickness smaller dowels often better</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf564011" class="outline-2">
<h2 id="orgf564011"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-26 Mon] </span></span> How Online Presence Can Help Your Engineering Career</h2>
<div class="outline-text-2" id="text-orgf564011">
<ul class="org-ul">
<li>Title: TSEC 86: How Online Presence Can Help Your Engineering Career</li>
<li>Interviewee: Luis Duque, Bridge Engineer (Foothills Bridge)</li>
<li>Use of LinkdIn/Insta/Personal blog to share what you are learning</li>
<li>Advocates blogging or podcasting to build internet presence</li>
<li>Advocates for networking, building connections with others in industry</li>
<li>Additional work outside work hours: tip is to work when energy levels are there, not forcing it, and consistency</li>
</ul>
</div>
</div>
<div id="outline-container-org8fa7843" class="outline-2">
<h2 id="org8fa7843"><span class="timestamp-wrapper"><span class="timestamp">[2022-09-06 Tue] </span></span> Automation and Communication in Structural Engineering</h2>
<div class="outline-text-2" id="text-org8fa7843">
<ul class="org-ul">
<li>Title: TSEC 85: Automation and Communication in Structural Engineering: Shaping the Future of Industry</li>
<li>Interviewee: Michael Bolduc (Simpson Gumpertz &amp; Heger [SGH])</li>
<li>Use of BIM/Revit to coordinate between disciplines</li>
<li>Importance of communication with architect due to faster pace of projects</li>
<li>Future direction is having BIM model as project deliverable</li>
<li>Do not detail too early in design to avoid time consuming changes</li>
</ul>
</div>
</div>

<div id="outline-container-org3f4c651" class="outline-2">
<h2 id="org3f4c651"><span class="timestamp-wrapper"><span class="timestamp">[2022-08-08 Mon] </span></span> Innovative Ways to Design and Build with Concrete</h2>
<div class="outline-text-2" id="text-org3f4c651">
<ul class="org-ul">
<li>Title: TSEC 83: Innovative Ways to Design and Build with Concrete</li>
<li>Helix reinforcement, generally used for slab on ground</li>
<li>Urged people to get involved with standards committees</li>
<li>Looking at efficient performance based design (yield line analysis, etc)</li>
</ul>
</div>
</div>

<div id="outline-container-org9d35a56" class="outline-2">
<h2 id="org9d35a56"><span class="timestamp-wrapper"><span class="timestamp">[2022-05-16 Mon] </span></span> CORD software training</h2>
<div class="outline-text-2" id="text-org9d35a56">
<p>
SCHEDULED: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-05-16 Mon 09:00&gt;&#x2013;&lt;2022-05-16 Mon 11:00&gt;</span></span>
</p>
<ul class="org-ul">
<li>Learnt software CORD for design of residential slabs to AS2870</li>
</ul>
</div>
</div>

<div id="outline-container-orgfa017ec" class="outline-2">
<h2 id="orgfa017ec"><span class="timestamp-wrapper"><span class="timestamp">[2021-10-01 Fri] </span></span> Seismic design of post installed anchors</h2>
<div class="outline-text-2" id="text-orgfa017ec">
<ul class="org-ul">
<li>Presenter: Damish Zuberi (Hilti)

<ul class="org-ul">
<li>Based on latest update to AS 5216</li>
<li>Bolts carry a seismic category rating (C1 or C2)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgef1e44b" class="outline-2">
<h2 id="orgef1e44b"><span class="timestamp-wrapper"><span class="timestamp">[2021-09-30 Thu] </span></span> Ultra-floor design</h2>
<div class="outline-text-2" id="text-orgef1e44b">
<ul class="org-ul">
<li>Presenter: Aaron Hazelton (Indesco)

<ul class="org-ul">
<li>Precast prestressed beams with concrete topping</li>
<li>Design always to capacity</li>
<li>Focus needs to be on detailing</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1217b72" class="outline-2">
<h2 id="org1217b72"><span class="timestamp-wrapper"><span class="timestamp">[2021-09-23 Thu] </span></span> Site inspection report</h2>
<div class="outline-text-2" id="text-org1217b72">
</div>
<div id="outline-container-org0f608b1" class="outline-3">
<h3 id="org0f608b1">Details</h3>
<div class="outline-text-3" id="text-org0f608b1">
<ul class="org-ul">
<li>Location</li>
<li>Job number</li>
<li>Date</li>
<li>Inspection stage</li>
<li>Builder contractor</li>
<li>Issued to/Inspected by/Signature</li>
</ul>
</div>
</div>

<div id="outline-container-org1654c9d" class="outline-3">
<h3 id="org1654c9d">Comments</h3>
<div class="outline-text-3" id="text-org1654c9d">
<p>
Indesco inspected the preparations for XXX. At the time of inspection
reinforcement had been installed up to XXX. All work appeared to
satisfy the desgn intent with the following comments:
</p>
</div>
</div>

<div id="outline-container-org406a90a" class="outline-3">
<h3 id="org406a90a">Instructions</h3>
<div class="outline-text-3" id="text-org406a90a">
<p>
Prior to pour, contractor to ensure:
</p>
<ul class="org-ul">
<li>Appropriate cover is maintained</li>
<li>Site is cleared of debris</li>
<li>Concrete is properly vibrated/compacted</li>
</ul>
</div>
</div>
</div>
