cpd.org
* [2021-09-03 Fri] What is our role as Structural Engineers
:PROPERTIES:
:type: Indesco training
:END:
:LOGBOOK:
CLOCK: [2021-09-03 Fri 13:30]--[2021-09-03 Fri 14:10] =>  0:40
:END:
- Presenter: Michael Smith (Indesco)

  - What makes us good? Cost effective designs/efficient designs
  - Mixed use/resi, all you need to do is line up units with car parks underneath
  - Start at the basement layout, put columns in the grid
  - Try to remove transfer in the resi above
  - 8m/200 slab (excluding end spans)
  - Simple designs provide simpler drafting, simpler details, simpler design

  - Design steps: eng markups early in the project, drafting later
  - Simplify as much as possible
  - Nut out design before drafting
  - More time spent during design can lead to less time on construction phase RFIs

* [2021-08-30 Mon] Dincel Wall Systems
:PROPERTIES:
:type: EA presentation
:END:
:LOGBOOK:
CLOCK: [2021-08-30 Mon 15:00]--[2021-08-30 Mon 15:30] =>  0:30
:END:
- Presenter: Robert Merjane, robertm@dincel.com.au

- Water proof walls and corners (slab to wall connection require membrane)
- Water proofing recommendations in the documentation
- Self compacting concrete recommended for the forms to prevent air pockets
- Otherwise we are relying on builders to properly compact
- Corner can slide up and down (good for inspections)
- Design recomendation is to treat PVC as void (apparently conservative) 
- Look into UTS paper for testing of strength
- GPR scanning good for finding air voids (other option is thermal scanning)
- FRP can be calculated by Eurocode (allowed by AS3600) and Dincel have a spreadsheet available on request

* [2021-08-15 Sun] WALLAP

** WALLAP training session
SCHEDULED: [2021-07-02 Wed 15:30-17:30]

- Presenter :: Dave Southgate

*** Setting up the model
1. Input soil parameters -> can choose soil params from linked file
   (good for same site)
2. For Ka/Ko F1 allows choice of \phi
3. Wall FE (finite element) length -> auto calculated
4. Make sure prop area is large enough otherwise it won't grab. Check
   moment diagram to confirm.
5. Prop free length -> length of prop in active soil block (take as
   45deg. from wall which is conservative)
   - NB. shoring contractor will give free length + props. We should
     provide free length minimum value.
6. Prop prestress set to zero for initial analysis.
7. Excavate 500 below prop press f1 26 a tag to to give space for
   install
8. BM options: nonlinear modulus parameter -> set to wall height
9. Run analysis. Check deflection and prop forces -> NB. horo
   component only is shown by WALLAP
10. Lock off load should be 60-70% of the final load
    
*** Notes
- Deflection should be small if sensitive structures around (20mm or less). To be agreed upon with geotech and client.
- Rule of thumb: one anchor per basement level. we can cantilever one floor at top.
- Email: /Geotechnical design parameters - from Thomas/ - consernative values.
- tanδ/tanɸ : wall friction coefficient for cohesive soil -> set to 0.667 for cohesive soils
- Don't directly engage geotech since they aren't insured
- Shorings AH likes 2.8m, DS likes 2.4m spacing for soldier piles. Unless smaller required
- Anchor -> 15deg gives good balance between min free length & cos angle (for load)
- Bug: young's modulus won't go past 2e7 when 2e8 is needed. Go back to update

* [2021-08-07 Sat] Fibre reinforced polymers

- Search terms: GFRP, CFRP, AFRP
- [[https://bestfiberglassrebar.com/applications/design-codes/][Design guides and standards]]

* [2021-07-23 Fri] Post tensioned slabs

** Design notes
*** Layout
- Prelim spacing is dependant on required P/A for crack control.
  1.4MPa for moderate control
- Edge stressing preferable
- Otherwise live ends should be 1m from obstructions and otherwise
  0.8m from edge (where edge stress not allowed but not obstructed)

*** Top reo
- Required to carry 25% of negative moment in column + 2* half mid
  spans
- Use a min of 4N16s in each direction

** PT Macro export
1. Save PTD file
2. Label the tendons clockwise in order of:
   - Xmin
   - Ymax
   - Xmax
   - Ymin
3. Check the number of tendons labelled (T01 -- TN) is correct
4. Run and save the PTD model
5. Export the drape values at high points (=Settings > Viewing >
   Tendons > High points= = =True=) with =Reports > Duct profiles= to
   =DuctHeight_report.$hlp.txt=
6. Repeat for mid/low points in =DuctHeight_report.$mp.txt=
7. Open Excel macro file and enter path/file locations in =Home= tab and
   run the =Shop Drawings= macro
8. For Xmin, Ymax, Xmax and Ymin (in order) take the corresponding
   values from the =Tendon NS= tab and paste to a spare space in the
   =Tendon No= tab
9. Take the min/max value and for each value in the column replace
   with the datum value
10. Click the =Strand Number Location= macro
11. Save the excel macro file
12. Open the CAD template and delete any drawings still there
13. Run VBAMAN and load =Import v1.XX.dvb=
14. Click =Macros= and run the macro, giving the correct path and
    filename of the excel macro workbook
15. Check and save the CAD dwg

** Deflection plots

- From :: Aidan McCabe

Just got a walkthrough by Dave on how he produces his deflection
plots. Thought I’d put it down into words so we can be consistent
across the office.

1. Open PTD file. Solve model and display deflection. Make sure your
   mesh is refined as much as possible (Dave likes 0.75m) and you have
   colours displayed in your deflections.
2. Take a screen shot of legend in top left of deflection plot.
3. Export this display to CAD.
4. In CAD, freeze the following
   - Text at bottom of export
   - Slab outline
5. In CAD, scale the output up (should be by 1000).
6. Drafters can then use this file to import into their drawing set.
   Send them the .dxf and the saved legend. They have a template set
   up for the legend where they can simply enter the numbers for that
   plot.

This process should be repeated for long term and short term
deflections. Often the deflection plot itself won’t look any different
between short and long term so the same plot can be used with two
legends on the sheet, one for each case.

