cpd.html

<div id="outline-container-orgc55c49e" class="outline-2">
<h2 id="orgc55c49e"><span class="timestamp-wrapper"><span class="timestamp">[2021-09-03 Fri] </span></span> What is our role as Structural Engineers</h2>
<div class="outline-text-2" id="text-orgc55c49e">
<ul class="org-ul">
<li>Presenter: Michael Smith (Indesco)

<ul class="org-ul">
<li>What makes us good? Cost effective designs/efficient designs</li>
<li>Mixed use/resi, all you need to do is line up units with car parks underneath</li>
<li>Start at the basement layout, put columns in the grid</li>
<li>Try to remove transfer in the resi above</li>
<li>8m/200 slab (excluding end spans)</li>
<li>Simple designs provide simpler drafting, simpler details, simpler design</li>

<li>Design steps: eng markups early in the project, drafting later</li>
<li>Simplify as much as possible</li>
<li>Nut out design before drafting</li>
<li>More time spent during design can lead to less time on construction phase RFIs</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6b8dc17" class="outline-2">
<h2 id="org6b8dc17"><span class="timestamp-wrapper"><span class="timestamp">[2021-08-30 Mon] </span></span> Dincel Wall Systems</h2>
<div class="outline-text-2" id="text-org6b8dc17">
<ul class="org-ul">
<li>Presenter: Robert Merjane, robertm@dincel.com.au</li>

<li>Water proof walls and corners (slab to wall connection require membrane)</li>
<li>Water proofing recommendations in the documentation</li>
<li>Self compacting concrete recommended for the forms to prevent air pockets</li>
<li>Otherwise we are relying on builders to properly compact</li>
<li>Corner can slide up and down (good for inspections)</li>
<li>Design recomendation is to treat PVC as void (apparently conservative)</li>
<li>Look into UTS paper for testing of strength</li>
<li>GPR scanning good for finding air voids (other option is thermal scanning)</li>
<li>FRP can be calculated by Eurocode (allowed by AS3600) and Dincel have a spreadsheet available on request</li>
</ul>
</div>
</div>

<div id="outline-container-org64507fb" class="outline-2">
<h2 id="org64507fb"><span class="timestamp-wrapper"><span class="timestamp">[2021-08-15 Sun] </span></span> WALLAP</h2>
<div class="outline-text-2" id="text-org64507fb">
</div>
<div id="outline-container-org14fb0c9" class="outline-3">
<h3 id="org14fb0c9">WALLAP training session</h3>
<div class="outline-text-3" id="text-org14fb0c9">
<dl class="org-dl">
<dt>Presenter</dt><dd>Dave Southgate</dd>
</dl>
</div>

<div id="outline-container-org7dcb072" class="outline-4">
<h4 id="org7dcb072">Setting up the model</h4>
<div class="outline-text-4" id="text-org7dcb072">
<ol class="org-ol">
<li>Input soil parameters -&gt; can choose soil params from linked file
(good for same site)</li>
<li>For Ka/Ko F1 allows choice of &phi;</li>
<li>Wall FE (finite element) length -&gt; auto calculated</li>
<li>Make sure prop area is large enough otherwise it won't grab. Check
moment diagram to confirm.</li>
<li>Prop free length -&gt; length of prop in active soil block (take as
45deg. from wall which is conservative)
<ul class="org-ul">
<li>NB. shoring contractor will give free length + props. We should
provide free length minimum value.</li>
</ul></li>
<li>Prop prestress set to zero for initial analysis.</li>
<li>Excavate 500 below prop press f1 26 a tag to to give space for
install</li>
<li>BM options: nonlinear modulus parameter -&gt; set to wall height</li>
<li>Run analysis. Check deflection and prop forces -&gt; NB. horo
component only is shown by WALLAP</li>
<li>Lock off load should be 60-70% of the final load</li>
</ol>
</div>
</div>

<div id="outline-container-orgd1376d8" class="outline-4">
<h4 id="orgd1376d8">Notes</h4>
<div class="outline-text-4" id="text-orgd1376d8">
<ul class="org-ul">
<li>Deflection should be small if sensitive structures around (20mm or less). To be agreed upon with geotech and client.</li>
<li>Rule of thumb: one anchor per basement level. we can cantilever one floor at top.</li>
<li>Email: <i>Geotechnical design parameters - from Thomas</i> - consernative values.</li>
<li>tanδ/tanɸ : wall friction coefficient for cohesive soil -&gt; set to 0.667 for cohesive soils</li>
<li>Don't directly engage geotech since they aren't insured</li>
<li>Shorings AH likes 2.8m, DS likes 2.4m spacing for soldier piles. Unless smaller required</li>
<li>Anchor -&gt; 15deg gives good balance between min free length &amp; cos angle (for load)</li>
<li>Bug: young's modulus won't go past 2e7 when 2e8 is needed. Go back to update</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org874bb11" class="outline-2">
<h2 id="org874bb11"><span class="timestamp-wrapper"><span class="timestamp">[2021-08-07 Sat] </span></span> Fibre reinforced polymers</h2>
<div class="outline-text-2" id="text-org874bb11">
<ul class="org-ul">
<li>Search terms: GFRP, CFRP, AFRP</li>
<li><a href="https://bestfiberglassrebar.com/applications/design-codes/">Design guides and standards</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf161e73" class="outline-2">
<h2 id="orgf161e73"><span class="timestamp-wrapper"><span class="timestamp">[2021-07-23 Fri] </span></span> Post tensioned slabs</h2>
<div class="outline-text-2" id="text-orgf161e73">
</div>
<div id="outline-container-org88f5b1e" class="outline-3">
<h3 id="org88f5b1e">Design notes</h3>
<div class="outline-text-3" id="text-org88f5b1e">
</div>
<div id="outline-container-org8ffd970" class="outline-4">
<h4 id="org8ffd970">Layout</h4>
<div class="outline-text-4" id="text-org8ffd970">
<ul class="org-ul">
<li>Prelim spacing is dependant on required P/A for crack control.
1.4MPa for moderate control</li>
<li>Edge stressing preferable</li>
<li>Otherwise live ends should be 1m from obstructions and otherwise
0.8m from edge (where edge stress not allowed but not obstructed)</li>
</ul>
</div>
</div>

<div id="outline-container-orgbab20fb" class="outline-4">
<h4 id="orgbab20fb">Top reo</h4>
<div class="outline-text-4" id="text-orgbab20fb">
<ul class="org-ul">
<li>Required to carry 25% of negative moment in column + 2* half mid
spans</li>
<li>Use a min of 4N16s in each direction</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org46959ac" class="outline-3">
<h3 id="org46959ac">PT Macro export</h3>
<div class="outline-text-3" id="text-org46959ac">
<ol class="org-ol">
<li>Save PTD file</li>
<li>Label the tendons clockwise in order of:
<ul class="org-ul">
<li>Xmin</li>
<li>Ymax</li>
<li>Xmax</li>
<li>Ymin</li>
</ul></li>
<li>Check the number of tendons labelled (T01 &#x2013; TN) is correct</li>
<li>Run and save the PTD model</li>
<li>Export the drape values at high points (<code>Settings &gt; Viewing &gt;
   Tendons &gt; High points</code> = <code>True</code>) with <code>Reports &gt; Duct profiles</code> to
<code>DuctHeight_report.$hlp.txt</code></li>
<li>Repeat for mid/low points in <code>DuctHeight_report.$mp.txt</code></li>
<li>Open Excel macro file and enter path/file locations in <code>Home</code> tab and
run the <code>Shop Drawings</code> macro</li>
<li>For Xmin, Ymax, Xmax and Ymin (in order) take the corresponding
values from the <code>Tendon NS</code> tab and paste to a spare space in the
<code>Tendon No</code> tab</li>
<li>Take the min/max value and for each value in the column replace
with the datum value</li>
<li>Click the <code>Strand Number Location</code> macro</li>
<li>Save the excel macro file</li>
<li>Open the CAD template and delete any drawings still there</li>
<li>Run VBAMAN and load <code>Import v1.XX.dvb</code></li>
<li>Click <code>Macros</code> and run the macro, giving the correct path and
filename of the excel macro workbook</li>
<li>Check and save the CAD dwg</li>
</ol>
</div>
</div>

<div id="outline-container-org7518e23" class="outline-3">
<h3 id="org7518e23">Deflection plots</h3>
<div class="outline-text-3" id="text-org7518e23">
<dl class="org-dl">
<dt>From</dt><dd>Aidan McCabe</dd>
</dl>

<p>
Just got a walkthrough by Dave on how he produces his deflection
plots. Thought I’d put it down into words so we can be consistent
across the office.
</p>

<ol class="org-ol">
<li>Open PTD file. Solve model and display deflection. Make sure your
mesh is refined as much as possible (Dave likes 0.75m) and you have
colours displayed in your deflections.</li>
<li>Take a screen shot of legend in top left of deflection plot.</li>
<li>Export this display to CAD.</li>
<li>In CAD, freeze the following
<ul class="org-ul">
<li>Text at bottom of export</li>
<li>Slab outline</li>
</ul></li>
<li>In CAD, scale the output up (should be by 1000).</li>
<li>Drafters can then use this file to import into their drawing set.
Send them the .dxf and the saved legend. They have a template set
up for the legend where they can simply enter the numbers for that
plot.</li>
</ol>

<p>
This process should be repeated for long term and short term
deflections. Often the deflection plot itself won’t look any different
between short and long term so the same plot can be used with two
legends on the sheet, one for each case.
</p>
</div>
</div>
