cpd.org
** Review process

- [ ] Page through to check overall content/presentation
- [ ] Check correct strand diameters/specs
- [ ] Check the material specifications
- [ ] Check for location of each duct
- [ ] Check number of strands in each duct
- [ ] Check live/dead end locations
- [ ] Check midpoint hat height values
- [ ] Stamp drawing

* [2021-07-21 Wed] Temporary Shoring and Propping Design in Australia
:PROPERTIES:
:type: EA presentation
:END:
:LOGBOOK:
CLOCK: [2021-07-21 Wed 12:30]--[2021-07-21 Wed 14:00] =>  1:30
:END:

- Presenter 1: Ying Tay (Golder Associates)
  - Drained state is more conservative
  - WALLAP uses beam-spring FEA, doing limit state equilibrium as well as FEA for servicability limit state
  - Better to spend money on good inputs & use a basic model
  - Look out for is blow out / floor heave (particularly in clay)

- Presenter 2: Sudhir Raina (Coates)
  - Glorified advertisement, not much relevance to topic

- Presenter 3: Harsh Bhambra (Delta Group)
  - Example project: London Hotel excavation, Melbourne

* [2021-06-24 Thu] The future of precast concrete
:PROPERTIES:
:type: EA presentation
:END:
:LOGBOOK:
CLOCK: [2021-06-24 Thu 17:00]--[2021-06-24 Thu 18:00] =>  1:00
:END:

- Presenter: Robert Aldrich (John Holland Group)

- Temporary timber molds for <5 pours, otherwise steel molds.
- usage of off the shelf reinforcement where possible.
- Larger size gives lower cost per meter, but requires transport/craning.
- Sustainability
  - Can be assembled + reused
  - Thermal mass, may not need finishes
- Innovation
  - Automated facilities developing creation of images (graphic concrete) using custom membranes.
  - Smart precast pavement
- References
  - Australian Precast Concrete Handbook

* [2021-06-15 Tue] Erection of the ANI Ship Assembly Hall
:PROPERTIES:
:type: EA presentation
:END:
:LOGBOOK:
CLOCK: [2021-06-15 Tue 17:30]--[2021-06-15 Tue 18:30] =>  1:00
:END:
- Presenter: James Deane-Butcher & Kyle Hourigan (Robert Bird Group)
- Summary
  - 200m portal frame, 50m height, 4000t steel sitting on 7m height blade walls
  - CMES Construction Methodology and Erection Sequence analysis
  - Rotation of walls and lift roof was used to remove working from heights
  - Used a tension strand jack for wall rotation paired with push-pull jacks for controlling when past tipping point
  - Walls can to past vertical to allow for roof lift
  - OSDP Wall rotation 2019 youtube ANI
  - [[https://www.youtube.com/watch?v=Zu53GqYdp9w][Wall rotation video]]
  - [[https://www.youtube.com/watch?v=FT4bKSLIyuI][Roof lift video]]
  - Accounted for jack failure in roof lift

* [2021-06-09 Wed] The DBP (NSW) for Engineers
:PROPERTIES:
:type: EA presentation
:END:
:LOGBOOK:
CLOCK: [2021-06-09 Wed 12:00]--[2021-06-09 Wed 13:00] =>  1:00
:END:
- Presenter: Greg Ewing
- The Design and Building Practitioners Act (NSW) for Engineers 
- Summary:
  - Relevant parts of legislation are Sections 31-33
  - Sec 31: Defines professional engineering
  - Sec 32: Defines work that requires PE qualification
  - Sec 33: To get paid for this work you must be PE
  - Info on application/maintaining PE quali is on fair-trade website
  - Required for engineers working on Class 2 buildings with >5yr experience
  - Next step is /Design practitioner/ which is required to sign off documentation (that it complies with BCA)
  - To maintain rego you must abide by code of practice, do 50hr/yr CPD, keep records for 10yrs and have insurance
    
* [2021-06-08 Tue] Professional liability and Ethics
:PROPERTIES:
:type: EA presentation
:END:
:LOGBOOK:
CLOCK: [2021-06-08 Tue 17:00]--[2021-06-08 Tue 18:00] =>  1:00
:END:
Summary:
- We don't have to worry about personal liability since action will be taken against the company/employer (but this is about financial loss, not job loss)
- The webinar had an unusual focus on law/court rather than ethics as advertised. It was more about what you can get away with rather than what is ethical
- Growth comes from stretching yourself/pushing beyond your current capability. Assume, when given these tasks, that your manager has good intentions when giving difficult assignments

* [2021-05-21 Fri] Engineering textbooks

Textbooks from uni (ticks mean I have PDF also):
- [X] Anil Chopra, Dynamics of Structures, Third Edition
- [ ] S Barry, Essential Mathematical Skills
- [X] R C Hibbeler, Structural Analysis, Eighth Edition in SI Units
- [X] Gere & Goodno, Mechanics of Materials, Seventh Edition
- [X] Glyn James, Modern Engineering Mathematics, Fourth Edition

* [2021-05-21 Fri] Inducta

** RCB
*** Model creation
1. Start from Indesco template in Indesco Library drive (has load combinations set up)
2. Define storey heights
3. CAD import for each level
4. Start drawing members (walls, columns, slabs, etc.)

*** Naming convention
XXXX(Project num) - Proj Name - RCB - XXXX.XX.XX(date arch base) -
XX(rev) - Description - Sub description - XX(initials)
*** Tips
- Meshing errors can be caused by discontinuity between levels
*** Wall/Deep Beam Design
Accessed through =Design > Wall/Deep Beam=

Settings:
- Steel MPa :: 500 for ULS
- Concr f'ct :: 0 for ULS (assume cracked)

* [2021-05-21 Fri] Pile design
** AS 2159
*** Section 1
**** Pile types
Displacement of non-displacement types - whether it displaces the soil
of its volume or not. Displacement piles are either large displacement
or small displacement Non-displacement piles are either
supported(/temporary support) or unsupported

*** Section 3 - Strength and serviceability design
**** Design for
1. Ultimate strength
2. Serviceability
3. Durability
4. Other (as required by client)

