cpd.html

<div id="outline-container-org0cc0018" class="outline-3">
<h3 id="org0cc0018">Review process</h3>
<div class="outline-text-3" id="text-org0cc0018">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Page through to check overall content/presentation</li>
<li class="off"><code>[&#xa0;]</code> Check correct strand diameters/specs</li>
<li class="off"><code>[&#xa0;]</code> Check the material specifications</li>
<li class="off"><code>[&#xa0;]</code> Check for location of each duct</li>
<li class="off"><code>[&#xa0;]</code> Check number of strands in each duct</li>
<li class="off"><code>[&#xa0;]</code> Check live/dead end locations</li>
<li class="off"><code>[&#xa0;]</code> Check midpoint hat height values</li>
<li class="off"><code>[&#xa0;]</code> Stamp drawing</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org26f1620" class="outline-2">
<h2 id="org26f1620"><span class="timestamp-wrapper"><span class="timestamp">[2021-07-21 Wed] </span></span> Temporary Shoring and Propping Design in Australia</h2>
<div class="outline-text-2" id="text-org26f1620">
<ul class="org-ul">
<li>Presenter 1: Ying Tay (Golder Associates)
<ul class="org-ul">
<li>Drained state is more conservative</li>
<li>WALLAP uses beam-spring FEA, doing limit state equilibrium as well as FEA for servicability limit state</li>
<li>Better to spend money on good inputs &amp; use a basic model</li>
<li>Look out for is blow out / floor heave (particularly in clay)</li>
</ul></li>

<li>Presenter 2: Sudhir Raina (Coates)
<ul class="org-ul">
<li>Glorified advertisement, not much relevance to topic</li>
</ul></li>

<li>Presenter 3: Harsh Bhambra (Delta Group)
<ul class="org-ul">
<li>Example project: London Hotel excavation, Melbourne</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orged1c0d2" class="outline-2">
<h2 id="orged1c0d2"><span class="timestamp-wrapper"><span class="timestamp">[2021-06-24 Thu] </span></span> The future of precast concrete</h2>
<div class="outline-text-2" id="text-orged1c0d2">
<ul class="org-ul">
<li>Presenter: Robert Aldrich (John Holland Group)</li>

<li>Temporary timber molds for &lt;5 pours, otherwise steel molds.</li>
<li>usage of off the shelf reinforcement where possible.</li>
<li>Larger size gives lower cost per meter, but requires transport/craning.</li>
<li>Sustainability
<ul class="org-ul">
<li>Can be assembled + reused</li>
<li>Thermal mass, may not need finishes</li>
</ul></li>
<li>Innovation
<ul class="org-ul">
<li>Automated facilities developing creation of images (graphic concrete) using custom membranes.</li>
<li>Smart precast pavement</li>
</ul></li>
<li>References
<ul class="org-ul">
<li>Australian Precast Concrete Handbook</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org512b8e4" class="outline-2">
<h2 id="org512b8e4"><span class="timestamp-wrapper"><span class="timestamp">[2021-06-15 Tue] </span></span> Erection of the ANI Ship Assembly Hall</h2>
<div class="outline-text-2" id="text-org512b8e4">
<ul class="org-ul">
<li>Presenter: James Deane-Butcher &amp; Kyle Hourigan (Robert Bird Group)</li>
<li>Summary
<ul class="org-ul">
<li>200m portal frame, 50m height, 4000t steel sitting on 7m height blade walls</li>
<li>CMES Construction Methodology and Erection Sequence analysis</li>
<li>Rotation of walls and lift roof was used to remove working from heights</li>
<li>Used a tension strand jack for wall rotation paired with push-pull jacks for controlling when past tipping point</li>
<li>Walls can to past vertical to allow for roof lift</li>
<li>OSDP Wall rotation 2019 youtube ANI</li>
<li><a href="https://www.youtube.com/watch?v=Zu53GqYdp9w">Wall rotation video</a></li>
<li><a href="https://www.youtube.com/watch?v=FT4bKSLIyuI">Roof lift video</a></li>
<li>Accounted for jack failure in roof lift</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org68a866e" class="outline-2">
<h2 id="org68a866e"><span class="timestamp-wrapper"><span class="timestamp">[2021-06-09 Wed] </span></span> The DBP (NSW) for Engineers</h2>
<div class="outline-text-2" id="text-org68a866e">
<ul class="org-ul">
<li>Presenter: Greg Ewing</li>
<li>The Design and Building Practitioners Act (NSW) for Engineers</li>
<li>Summary:
<ul class="org-ul">
<li>Relevant parts of legislation are Sections 31-33</li>
<li>Sec 31: Defines professional engineering</li>
<li>Sec 32: Defines work that requires PE qualification</li>
<li>Sec 33: To get paid for this work you must be PE</li>
<li>Info on application/maintaining PE quali is on fair-trade website</li>
<li>Required for engineers working on Class 2 buildings with &gt;5yr experience</li>
<li>Next step is <i>Design practitioner</i> which is required to sign off documentation (that it complies with BCA)</li>
<li>To maintain rego you must abide by code of practice, do 50hr/yr CPD, keep records for 10yrs and have insurance</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge0eb45f" class="outline-2">
<h2 id="orge0eb45f"><span class="timestamp-wrapper"><span class="timestamp">[2021-06-08 Tue] </span></span> Professional liability and Ethics</h2>
<div class="outline-text-2" id="text-orge0eb45f">
<p>
Summary:
</p>
<ul class="org-ul">
<li>We don't have to worry about personal liability since action will be taken against the company/employer (but this is about financial loss, not job loss)</li>
<li>The webinar had an unusual focus on law/court rather than ethics as advertised. It was more about what you can get away with rather than what is ethical</li>
<li>Growth comes from stretching yourself/pushing beyond your current capability. Assume, when given these tasks, that your manager has good intentions when giving difficult assignments</li>
</ul>
</div>
</div>

<div id="outline-container-orge3f537d" class="outline-2">
<h2 id="orge3f537d"><span class="timestamp-wrapper"><span class="timestamp">[2021-05-21 Fri] </span></span> Engineering textbooks</h2>
<div class="outline-text-2" id="text-orge3f537d">
<p>
Textbooks from uni (ticks mean I have PDF also):
</p>
<ul class="org-ul">
<li class="on"><code>[X]</code> Anil Chopra, Dynamics of Structures, Third Edition</li>
<li class="off"><code>[&#xa0;]</code> S Barry, Essential Mathematical Skills</li>
<li class="on"><code>[X]</code> R C Hibbeler, Structural Analysis, Eighth Edition in SI Units</li>
<li class="on"><code>[X]</code> Gere &amp; Goodno, Mechanics of Materials, Seventh Edition</li>
<li class="on"><code>[X]</code> Glyn James, Modern Engineering Mathematics, Fourth Edition</li>
</ul>
</div>
</div>

<div id="outline-container-orgdfcb6a4" class="outline-2">
<h2 id="orgdfcb6a4"><span class="timestamp-wrapper"><span class="timestamp">[2021-05-21 Fri] </span></span> Inducta</h2>
<div class="outline-text-2" id="text-orgdfcb6a4">
</div>
<div id="outline-container-orgf43c615" class="outline-3">
<h3 id="orgf43c615">RCB</h3>
<div class="outline-text-3" id="text-orgf43c615">
</div>
<div id="outline-container-org9af9f29" class="outline-4">
<h4 id="org9af9f29">Model creation</h4>
<div class="outline-text-4" id="text-org9af9f29">
<ol class="org-ol">
<li>Start from Indesco template in Indesco Library drive (has load combinations set up)</li>
<li>Define storey heights</li>
<li>CAD import for each level</li>
<li>Start drawing members (walls, columns, slabs, etc.)</li>
</ol>
</div>
</div>

<div id="outline-container-org6217776" class="outline-4">
<h4 id="org6217776">Naming convention</h4>
<div class="outline-text-4" id="text-org6217776">
<p>
XXXX(Project num) - Proj Name - RCB - XXXX.XX.XX(date arch base) -
XX(rev) - Description - Sub description - XX(initials)
</p>
</div>
</div>
<div id="outline-container-org4049e72" class="outline-4">
<h4 id="org4049e72">Tips</h4>
<div class="outline-text-4" id="text-org4049e72">
<ul class="org-ul">
<li>Meshing errors can be caused by discontinuity between levels</li>
</ul>
</div>
</div>
<div id="outline-container-orgad730b7" class="outline-4">
<h4 id="orgad730b7">Wall/Deep Beam Design</h4>
<div class="outline-text-4" id="text-orgad730b7">
<p>
Accessed through <code>Design &gt; Wall/Deep Beam</code>
</p>

<p>
Settings:
</p>
<dl class="org-dl">
<dt>Steel MPa</dt><dd>500 for ULS</dd>
<dt>Concr f'ct</dt><dd>0 for ULS (assume cracked)</dd>
</dl>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdd6f9cd" class="outline-2">
<h2 id="orgdd6f9cd"><span class="timestamp-wrapper"><span class="timestamp">[2021-05-21 Fri] </span></span> Pile design</h2>
<div class="outline-text-2" id="text-orgdd6f9cd">
</div>
<div id="outline-container-orge6cd5cd" class="outline-3">
<h3 id="orge6cd5cd">AS 2159</h3>
<div class="outline-text-3" id="text-orge6cd5cd">
</div>
<div id="outline-container-orga1b6369" class="outline-4">
<h4 id="orga1b6369">Section 1</h4>
<div class="outline-text-4" id="text-orga1b6369">
</div>
<ul class="org-ul">
<li><a id="orga82c21a"></a>Pile types<br />
<div class="outline-text-5" id="text-orga82c21a">
<p>
Displacement of non-displacement types - whether it displaces the soil
of its volume or not. Displacement piles are either large displacement
or small displacement Non-displacement piles are either
supported(/temporary support) or unsupported
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org957c056" class="outline-4">
<h4 id="org957c056">Section 3 - Strength and serviceability design</h4>
<div class="outline-text-4" id="text-org957c056">
</div>
<ul class="org-ul">
<li><a id="org98e22aa"></a>Design for<br />
<div class="outline-text-5" id="text-org98e22aa">
<ol class="org-ol">
<li>Ultimate strength</li>
<li>Serviceability</li>
<li>Durability</li>
<li>Other (as required by client)</li>
</ol>
</div>
</li>
