cpd.org
**** Ultimate strength
Design geotechnical strength and design structural strength must be
greater than design action effect:
- $R_{d,g} \ge E_d$
- $R_{d,s} \ge E_d$

Actions specified in AS 1170.0

***** R_d,ug
$R_{d,ug} = f_{m,s}A_s + (f_b + p_o)A_b - W$ and, assuming $W =
A_{b}p_{o}$ $R_{d,ug} = f_{m,s}A_s + f_{b}A_b$

**** Serviceability
Pile displacement $\delta$ should be controlled.

   
*** Section 4
*** Section 5
*** Section 6
*** Section 7
*** Section 8

* [2021-05-21 Fri] RAPT

** Default settings to consider
*** General
- Pattern Live Load: No
*** Design Data
- Ultimate
  - Minimum Reinforcement Strength Limit: 1.33
- Crack control
  - Max Service Stress Change - PT & Reo: 200 MPa
- Deflection
  - Maximum Value of Ieff/Igross: 1 (due to PT)
  - Incremental Deflection Warning Limit: 500
  - Time of Loading: 28 days

*** Design considerations
- Columns
  - Change the column percentage stiffness (20%)
- Transverse columns
  - Should probably be knife-edge connection?

* [2021-05-21 Fri] Structural toolkit

** 2021.04.29 Conference - Use and tips
1. Check setup tab (save some settings as defaults)
2. Add sheets on the left pane, adding to the project
*** Tips
- Link sheets together :: Useful for joist - beam loadings
  - Highlight
  - R. Click
  - Fill form
- Convert between timber/steel members :: Carries over loadings (MEMBERS tab)
- DOCUMENT > MEMBER SUMMARY/RXN SUMMARY
- Can set modules to NOT PRINTED :: for use with PRINT/EXPORT all PROJECT TAB DOCUMENT TAB for printing all pot current
- CTRL + CLICK :: Allows selection of other versions of modules Colder codes)
- Members Presets :: Can change default values (eg. Wind load)

* [2021-05-21 Fri] Structural integrity reinforcement

*AS3600:2018 Section 9.2*

** Integrity reinforcement
*** Email from Daruis
Afternoon All!

I’ve been working on a couple of projects where I have been
considering our favourite topic…Integrity Reinforcement.

For the Engineers, see below for a detailed run down.

For the drafters…be aware that we are now required to add extra
reinforcement bars directly over our columns (in the bottom
reinforcement) – see attached PDF markup for a typical slab.

Clause 9.2 Structural Integrity Reinforcement

We are still debating what is exactly required and are trying to
utilize our PT strand as a way of minimizing the extent, however the
code does not allow us to consider PT strand at the moment (despite
zero testing or theory backing this up). In any case, in order to
achieve compliance with Clause 9.2, we must detail an amount of
reinforcement over the columns in the bottom reinforcement layer which
is directly related to the ultimate reaction N* for the particular
column under consideration.

The summation of the reinforcement at a particular column is given by
equation 9.2.2 reproduced below:

To calculate N*, work out the tributary area and multiply by your
ultimate load case (1.2G + 1.5Q).

These bars are required to be placed WITHIN the column core and they
must extend a minimum 2 x Lsy.tb from the face of the column, and
should be cogged at discontinuous edges.

This means, that the length of the bar will be dependent on the bar
diameter selected, and hence, ideally we would select the smallest bar
size possible, however we are restricted to keeping the bars within
the column core, and so this will not always be possible.

The other thing is, we are not required to have an even amount of bars
in each direction of the column (i.e. 3N16’s EW). We simply need a
minimum of 2 bars or 2 strands in each direction (Cl. 9.2.1).
Therefore, we could potentially have 2N16’s in one direction and
4N16’s in the other direction.

As an example, I have attached a copy of a typical 200mm thick slab
for a post tension job I am looking at. The first page is a markup of
the integrity reinforcement required for the deck, the second page
shows the trib. area for each column in blue, and in green is the
integrity reinforcement required for each column based on equation
9.2.2.

I have also attached a spreadsheet that I am working on in order to
simplify the design process for us. This is under development and I
will look to improve this to speed this process up as much as
possible.

Numerical Example Let’s consider the column above the top right hand
side of the core as shown below:

As you can see above, the trib area for the column is 48.4m2. Now we
will use the spreadsheet to calculate our required integrity
reinforcement for the column.

If you open the spreadsheet up, you will see this:

Only red text requires an input, everything else will be calculated
for you.

From the top work through the “Basic development length” inputs in
red.

Input f’c, D (slab depth), cover, fsy, db (bar diameter), spacing; in
this example I have decided to use N16 bars initially.

This will generate your basic development length (yellow rectangle).

Next, enter your column dimensions, trib area and your pressure loads.
The spreadsheet will calculate you slab self weight from the depth you
provided in the basic development length above.

This will then generate the total area you need to satisfy the
integrity reo (green box), and in the pink box, it will call up the
number of bars you require for that bar size.

I have also calculated the lengths required for your bars for an
internal column and an edge column (external span).

So for this example, we can get away with 12N16’s (note I have used
13N16’s in my markup as I have rounded up and am using this deck as an
exercise for a client).

Now, say you can’t fit 12N16’s in your column, you will need to
increase the bar size, let’s try N20’s.

Simply change the bar size you originally selected to 20 and the
spreadsheet will do the rest:

We now only require 8N20’s, but note how the required bar lengths have
increased significantly!

This will likely be a topic we will re-visit on our training day on
the 6th of December.

In the meantime though, engineers please read through Clause 9.2 of
AS3600 (2018) and get yourselves familiar with the clause as it will
likely be here to stay.


