cpd.html

<li><a id="org17e4b7f"></a>Ultimate strength<br />
<div class="outline-text-5" id="text-org17e4b7f">
<p>
Design geotechnical strength and design structural strength must be
greater than design action effect:
</p>
<ul class="org-ul">
<li>\(R_{d,g} \ge E_d\)</li>
<li>\(R_{d,s} \ge E_d\)</li>
</ul>

<p>
Actions specified in AS 1170.0
</p>
</div>

<ul class="org-ul">
<li><a id="org8db8911"></a>R<sub>d,ug</sub><br />
<div class="outline-text-6" id="text-org8db8911">
<p>
\(R_{d,ug} = f_{m,s}A_s + (f_b + p_o)A_b - W\) and, assuming \(W =
A_{b}p_{o}\) \(R_{d,ug} = f_{m,s}A_s + f_{b}A_b\)
</p>
</div>
</li>
</ul>
</li>

<li><a id="orge49596d"></a>Serviceability<br />
<div class="outline-text-5" id="text-orge49596d">
<p>
Pile displacement \(\delta\) should be controlled.
</p>
</div>
</li>
</ul>
</div>


<div id="outline-container-orgfe6bb78" class="outline-4">
<h4 id="orgfe6bb78">Section 4</h4>
</div>
<div id="outline-container-org9adc6c9" class="outline-4">
<h4 id="org9adc6c9">Section 5</h4>
</div>
<div id="outline-container-orgd72a431" class="outline-4">
<h4 id="orgd72a431">Section 6</h4>
</div>
<div id="outline-container-org5cec3f0" class="outline-4">
<h4 id="org5cec3f0">Section 7</h4>
</div>
<div id="outline-container-org801dba6" class="outline-4">
<h4 id="org801dba6">Section 8</h4>
</div>
</div>
</div>

<div id="outline-container-orgf0c6602" class="outline-2">
<h2 id="orgf0c6602"><span class="timestamp-wrapper"><span class="timestamp">[2021-05-21 Fri] </span></span> RAPT</h2>
<div class="outline-text-2" id="text-orgf0c6602">
</div>
<div id="outline-container-org902fb67" class="outline-3">
<h3 id="org902fb67">Default settings to consider</h3>
<div class="outline-text-3" id="text-org902fb67">
</div>
<div id="outline-container-org120c27e" class="outline-4">
<h4 id="org120c27e">General</h4>
<div class="outline-text-4" id="text-org120c27e">
<ul class="org-ul">
<li>Pattern Live Load: No</li>
</ul>
</div>
</div>
<div id="outline-container-orgd8e6511" class="outline-4">
<h4 id="orgd8e6511">Design Data</h4>
<div class="outline-text-4" id="text-orgd8e6511">
<ul class="org-ul">
<li>Ultimate
<ul class="org-ul">
<li>Minimum Reinforcement Strength Limit: 1.33</li>
</ul></li>
<li>Crack control
<ul class="org-ul">
<li>Max Service Stress Change - PT &amp; Reo: 200 MPa</li>
</ul></li>
<li>Deflection
<ul class="org-ul">
<li>Maximum Value of Ieff/Igross: 1 (due to PT)</li>
<li>Incremental Deflection Warning Limit: 500</li>
<li>Time of Loading: 28 days</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org405ba69" class="outline-4">
<h4 id="org405ba69">Design considerations</h4>
<div class="outline-text-4" id="text-org405ba69">
<ul class="org-ul">
<li>Columns
<ul class="org-ul">
<li>Change the column percentage stiffness (20%)</li>
</ul></li>
<li>Transverse columns
<ul class="org-ul">
<li>Should probably be knife-edge connection?</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org9a01a2d" class="outline-2">
<h2 id="org9a01a2d"><span class="timestamp-wrapper"><span class="timestamp">[2021-05-21 Fri] </span></span> Structural toolkit</h2>
<div class="outline-text-2" id="text-org9a01a2d">
</div>
<div id="outline-container-org7a2f349" class="outline-3">
<h3 id="org7a2f349">2021.04.29 Conference - Use and tips</h3>
<div class="outline-text-3" id="text-org7a2f349">
<ol class="org-ol">
<li>Check setup tab (save some settings as defaults)</li>
<li>Add sheets on the left pane, adding to the project</li>
</ol>
</div>
<div id="outline-container-orge5ad177" class="outline-4">
<h4 id="orge5ad177">Tips</h4>
<div class="outline-text-4" id="text-orge5ad177">
<dl class="org-dl">
<dt>Link sheets together</dt><dd>Useful for joist - beam loadings
<ul class="org-ul">
<li>Highlight</li>
<li>R. Click</li>
<li>Fill form</li>
</ul></dd>
<dt>Convert between timber/steel members</dt><dd>Carries over loadings (MEMBERS tab)</dd>
<dt>(no term)</dt><dd>DOCUMENT &gt; MEMBER SUMMARY/RXN SUMMARY</dd>
<dt>Can set modules to NOT PRINTED</dt><dd>for use with PRINT/EXPORT all PROJECT TAB DOCUMENT TAB for printing all pot current</dd>
<dt>CTRL + CLICK</dt><dd>Allows selection of other versions of modules Colder codes)</dd>
<dt>Members Presets</dt><dd>Can change default values (eg. Wind load)</dd>
</dl>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf79a4a7" class="outline-2">
<h2 id="orgf79a4a7"><span class="timestamp-wrapper"><span class="timestamp">[2021-05-21 Fri] </span></span> Structural integrity reinforcement</h2>
<div class="outline-text-2" id="text-orgf79a4a7">
<p>
<b>AS3600:2018 Section 9.2</b>
</p>
</div>

<div id="outline-container-orgda540e0" class="outline-3">
<h3 id="orgda540e0">Integrity reinforcement</h3>
<div class="outline-text-3" id="text-orgda540e0">
</div>
<div id="outline-container-org22edf48" class="outline-4">
<h4 id="org22edf48">Email from Daruis</h4>
<div class="outline-text-4" id="text-org22edf48">
<p>
Afternoon All!
</p>

<p>
I’ve been working on a couple of projects where I have been
considering our favourite topic…Integrity Reinforcement.
</p>

<p>
For the Engineers, see below for a detailed run down.
</p>

<p>
For the drafters…be aware that we are now required to add extra
reinforcement bars directly over our columns (in the bottom
reinforcement) – see attached PDF markup for a typical slab.
</p>

<p>
Clause 9.2 Structural Integrity Reinforcement
</p>

<p>
We are still debating what is exactly required and are trying to
utilize our PT strand as a way of minimizing the extent, however the
code does not allow us to consider PT strand at the moment (despite
zero testing or theory backing this up). In any case, in order to
achieve compliance with Clause 9.2, we must detail an amount of
reinforcement over the columns in the bottom reinforcement layer which
is directly related to the ultimate reaction N* for the particular
column under consideration.
</p>

<p>
The summation of the reinforcement at a particular column is given by
equation 9.2.2 reproduced below:
</p>

<p>
To calculate N*, work out the tributary area and multiply by your
ultimate load case (1.2G + 1.5Q).
</p>

<p>
These bars are required to be placed WITHIN the column core and they
must extend a minimum 2 x Lsy.tb from the face of the column, and
should be cogged at discontinuous edges.
</p>

<p>
This means, that the length of the bar will be dependent on the bar
diameter selected, and hence, ideally we would select the smallest bar
size possible, however we are restricted to keeping the bars within
the column core, and so this will not always be possible.
</p>

<p>
The other thing is, we are not required to have an even amount of bars
in each direction of the column (i.e. 3N16’s EW). We simply need a
minimum of 2 bars or 2 strands in each direction (Cl. 9.2.1).
Therefore, we could potentially have 2N16’s in one direction and
4N16’s in the other direction.
</p>

<p>
As an example, I have attached a copy of a typical 200mm thick slab
for a post tension job I am looking at. The first page is a markup of
the integrity reinforcement required for the deck, the second page
shows the trib. area for each column in blue, and in green is the
integrity reinforcement required for each column based on equation
9.2.2.
</p>

<p>
I have also attached a spreadsheet that I am working on in order to
simplify the design process for us. This is under development and I
will look to improve this to speed this process up as much as
possible.
</p>

<p>
Numerical Example Let’s consider the column above the top right hand
side of the core as shown below:
</p>

<p>
As you can see above, the trib area for the column is 48.4m2. Now we
will use the spreadsheet to calculate our required integrity
reinforcement for the column.
</p>

<p>
If you open the spreadsheet up, you will see this:
</p>

<p>
Only red text requires an input, everything else will be calculated
for you.
</p>

<p>
From the top work through the “Basic development length” inputs in
red.
</p>

<p>
Input f’c, D (slab depth), cover, fsy, db (bar diameter), spacing; in
this example I have decided to use N16 bars initially.
</p>

<p>
This will generate your basic development length (yellow rectangle).
</p>

<p>
Next, enter your column dimensions, trib area and your pressure loads.
The spreadsheet will calculate you slab self weight from the depth you
provided in the basic development length above.
</p>

<p>
This will then generate the total area you need to satisfy the
integrity reo (green box), and in the pink box, it will call up the
number of bars you require for that bar size.
</p>

<p>
I have also calculated the lengths required for your bars for an
internal column and an edge column (external span).
</p>

<p>
So for this example, we can get away with 12N16’s (note I have used
13N16’s in my markup as I have rounded up and am using this deck as an
exercise for a client).
</p>

<p>
Now, say you can’t fit 12N16’s in your column, you will need to
increase the bar size, let’s try N20’s.
</p>

<p>
Simply change the bar size you originally selected to 20 and the
spreadsheet will do the rest:
</p>

<p>
We now only require 8N20’s, but note how the required bar lengths have
increased significantly!
</p>

<p>
This will likely be a topic we will re-visit on our training day on
the 6th of December.
</p>

<p>
In the meantime though, engineers please read through Clause 9.2 of
AS3600 (2018) and get yourselves familiar with the clause as it will
likely be here to stay.
</p>
</div>
</div>
</div>
</div>
