cpd.org
* Tracker
#+BEGIN: clocktable :scope file :properties ("type") :block 2023
#+CAPTION: Clock summary at [2023-03-07 Tue 14:12], for the year 2023.
| type                  | Headline                               | Time |
|-----------------------+----------------------------------------+------|
|                       | *Total time*                             | *4:30* |
|-----------------------+----------------------------------------+------|
| External presentation | [2023-02-16 Thu] Penetron presentation | 1:00 |
| podcast               | [2023-02-10 Fri] The Structural...     | 1:00 |
| podcast               | [2023-02-04 Sat] Episode 71 -...       | 1:00 |
| EA presentation       | [2023-02-03 Fri] How to become a...    | 1:00 |
| podcast               | [2023-02-03 Fri] TSEC 95 Why Mass...   | 0:30 |
#+END:
