cpd.html


<div id="outline-container-org9f83e64" class="outline-2">
<h2 id="org9f83e64">Tracker</h2>
<div class="outline-text-2" id="text-org9f83e64">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2023-03-07 Tue 14:12]</span></span>, for the year 2023.</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">type</th>
<th scope="col" class="org-left">Headline</th>
<th scope="col" class="org-right">Time</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left"><b>Total time</b></td>
<td class="org-right"><b>4:30</b></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">External presentation</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-16 Thu] </span></span> Penetron presentation</td>
<td class="org-right">1:00</td>
</tr>

<tr>
<td class="org-left">podcast</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-10 Fri] </span></span> The Structural&#x2026;</td>
<td class="org-right">1:00</td>
</tr>

<tr>
<td class="org-left">podcast</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-04 Sat] </span></span> Episode 71 -&#x2026;</td>
<td class="org-right">1:00</td>
</tr>

<tr>
<td class="org-left">EA presentation</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-03 Fri] </span></span> How to become a&#x2026;</td>
<td class="org-right">1:00</td>
</tr>

<tr>
<td class="org-left">podcast</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">[2023-02-03 Fri] </span></span> TSEC 95 Why Mass&#x2026;</td>
<td class="org-right">0:30</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
